Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.TypeName Property
 The name of the surface treatment type. The valid names are defined in the product_finishes.dat file.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string TypeName { get; set; }
Public Property TypeName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace